<?php
/**
 * バリデーションメッセージ
 */

return [
    'required'    => '必須項目です。',
    'min'         => ':min文字以上で入力してください。',
    'max'         => ':max文字以内で入力してください。',
    'min-price'   => ':min円以上で入力してください。',
    'max-price'   => ':max円以内で入力してください。',
    'file-max'    => ':maxMB以下のファイルを選択してください。',
    'image-mimes' => 'png・jpeg・gifのいずれかの拡張子のファイルを選択してください。',
    'numeric'     => '数値で入力してください。',
    'email'       => 'メールアドレスの形式で入力してください。',
    'month'       => '有効な月を入力してください',
    'regex'       => '指定された形式で入力してください。',
    'digits'      => ':digits文字で入力してください。',
    'integer'     => '数値で入力してください。',
    'exists'      => '指定したコードは存在しません。',
    'login'       => 'メールアドレスまたはパスワードが正しくありません。',
    'unique'      => 'すでに使用されています。',
];
